package com.hb.cm;

// 인터페이스 : 서비스를 제공하는 목록
//			추상 메소드와 상수만을 가질 수 있다.(생성자 없다)
//			생성자가 없으므로 객체 생성을 할 수 없다.
// 			인터페이스가 같다는 것은 대체, 호환이 가능하다는 뜻이다.
//			인터페이스는 객체로 만들 수 없으므로 일반 클래스가 상속하여 사용한다.
//
// 인터페이스 상속시 처리 방법
//	1) 일반 클래스 : 인터페이스가 가지고 있는 추상 메소드를 오버라이딩 한다.
//	2) 인터페이스로 만든다. (오버라이딩 할 필요 없음)
//	3) 추상 클래스로 만든다. (오버라이딩 할 필요 없음)

public interface Ex01 {
	// 인터페이스는 상수와 추상 메소드만 갖는다.
	// 아래 입력한 변수는 강제로 static final로 바뀌어 상수가 된다.
	int su1 = 10;
	final int su2 = 20;
	static int su3 = 30;
	static final int su4 = 40;
	
//	public void add(){};	// 일반 메소드이므로 오류 발생
	
	public abstract void sub();
	public void mul();	// 추상 클래스는 오류지만 인터페이스에서는 abstract 생략 가능

}
